src/Documents/Бронь/Бронь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронь</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоДнямМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоМесяцам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОкончанияПовторения</name>
    <type>
      <types>EnumRef.ПравилаОкончанияПовторения</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСозданияБрони</name>
    <type>
      <types>EnumRef.СпособыСозданияБрони</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеОбеспечение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписи</name>
    <type>
      <types>EnumRef.ТипЗаписиКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПомещение</name>
    <type>
      <types>CatalogRef.УдалитьПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственноеОбеспечение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПовторения</name>
    <type>
      <types>EnumRef.ЧастотаПовторения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияПовторения</name>
    <attributes>
      <name>ДатаИсключения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьИсключения</name>
      <type>
        <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторениеПоДням</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Бронь/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Помещение");
	Поля.Добавить("ДатаНачала");
	Поля.Добавить("ДатаОкончания");
	Поля.Добавить("ВесьДень");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПредставлениеДаты = БронированиеПомещенийКлиентСервер.СформироватьДатыБрони(
		Данные.ДатаНачала, Данные.ДатаОкончания, Данные.ВесьДень);
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 - %2'"),
		Данные.Помещение,
		ПредставлениеДаты);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет, подходит ли объект к шаблону бизнес-процесса
Функция ШаблонПодходитДляАвтозапускаБизнесПроцессаПоОбъекту(ШаблонСсылка, ПредметСсылка, Подписчик, ВидСобытия, Условие) Экспорт
	
	Возврат БизнесСобытияВызовСервера.ШаблонПодходитДляАвтозапускаБизнесПроцессаПоПредмету(ШаблонСсылка, 
		ПредметСсылка, Подписчик, ВидСобытия, Условие);
	
КонецФункции

// Возвращает имя предмета процесса по умолчанию.
//
Функция ПолучитьИмяПредметаПоУмолчанию(Ссылка) Экспорт
	
	Возврат НСтр("ru='Бронь'");
	
КонецФункции

#КонецОбласти

#КонецЕсли
